# Primera Parte: Carga de Datos

In [66]:
import pandas as pd

In [67]:
# En esta parte se carga la Data y se visualiza la cantidad de campos que se tiene en la data.
Uni=pd.read_csv('qs-world-university-rankings-2017-to-2022-V2.csv')
Uni.head()
Uni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6482 entries, 0 to 6481
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   university              6482 non-null   object
 1   year                    6482 non-null   int64
 2   rank_display            6414 non-null   object
 3   score                   2820 non-null   float64
 4   link                    6482 non-null   object
 5   country                 6482 non-null   object
 6   city                    6304 non-null   object
 7   region                  6482 non-null   object
 8   logo                    6482 non-null   object
 9   type                    6470 non-null   object
 10  research_output         6480 non-null   object
 11  student_faculty_ratio   6407 non-null   float64
 12  international_students  6318 non-null   object
 13  size                    6480 non-null   object
 14  faculty_count           6404 non-null   object
dtypes: float64(2), int64(1), object(12)
memory usage: 759.7+ KB

# Segunda Parte: Limpieza de Datos

In [68]:
#Seleccionando los campos con los que se va a trabajar.
Uni=Uni[['research_output','international_students','type','score',]]

In [69]:
#ver el numero de registros null.
Uni.isna().sum()

research_output              2
international_students     164
type                        12
score                     3662
dtype: int64

In [70]:
Uni

     research_output international_students     type  score
0          Very High                  3,730  Private  100.0
1          Very High                  3,879  Private   98.7
2          Very High                  5,877  Private   98.3
3          Very high                  7,925   Public   97.2
4          Very High                    692  Private   96.9
...              ...                    ...      ...    ...
6477            High                     57   Public    NaN
6478       Very High                    585   Public    NaN
6479          Medium                  2,826   Public    NaN
6480            High                  2,394   Public    NaN
6481            High                  2,300   Public    NaN

[6482 rows x 4 columns]

In [72]:
#Llenando los campos nulos con la media del campo score.
Uni['score'] = Uni['score'].fillna(Uni['score'].mean())
Uni.isna().sum()

research_output             2
international_students    164
type                       12
score                       0
dtype: int64

In [115]:
#llenando de el tipo de universidad con private o public. 
import random as rd
tipos=['private','public']
def filltype(tipo):
 i=rd.randint(0,1) # rango de 0 a 1
 tipo=tipos[i]
 return tipo
Uni['type'] = Uni['type'].fillna(Uni['type'].apply(filltype))

In [117]:
Uni

     research_output international_students     type       score
0          Very High                  3,730  Private  100.000000
1          Very High                  3,879  Private   98.700000
2          Very High                  5,877  Private   98.300000
3          Very high                  7,925   Public   97.200000
4          Very High                    692  Private   96.900000
...              ...                    ...      ...         ...
6477            High                     57   Public   46.595532
6478       Very High                    585   Public   46.595532
6479          Medium                  2,826   Public   46.595532
6480            High                  2,394   Public   46.595532
6481            High                  2,300   Public   46.595532

[6482 rows x 4 columns]

In [119]:
Uni.isna().sum()

research_output             2
international_students    164
type                        0
score                       0
dtype: int64

In [120]:
quality=['very high','medium','high','low']
def fillquality(tipo):
 i=rd.randint(0,3)
 tipo=quality[i]
 return tipo
Uni['research_output'] = Uni['research_output'].fillna(Uni['research_output'].apply(fillquality))

In [133]:
Uni.isna().sum()
#estandarizando los datos "reasearch_output y type" a minuscula
Uni['research_output']=Uni['research_output'].str.lower()
Uni['type'] = Uni['type'].str.lower()

In [135]:
Uni.head(20)

   research_output  international_students     type  score
0        very high                    3730  private  100.0
1        very high                    3879  private   98.7
2        very high                    5877  private   98.3
3        very high                    7925   public   97.2
4        very high                     692  private   96.9
5        very high                    8442   public   96.8
6        very high                   21824   public   95.6
7        very high                    7733   public   94.2
8        very high                   11143   public   94.1
9        very high                    4696  private   93.0
10       very high                    1912  private   92.8
11       very high                    7551   public   91.5
12       very high                    6091   public   91.4
13       very high                    6426   public   91.1
14       very high                    2537  private   90.9
15       very high                    5675  private   90.1
16       very high                    5070  private   89.3
17       very high                    4636  private   89.0
18       very high                   14637   public   88.9
19       very high                   11252  private   88.6

In [123]:
import re
#Limpiando los puntos y comas del campo international_students
Uni['international_students']=Uni['international_students'].str.replace(re.compile('[\.,]'),'')

In [124]:
#llenado del campo international_students con valores de rango [1000-25000]
def fillstudents(tipo):
 i=rd.randint(1000,25000)
 return str(i)
Uni['international_students']= Uni['international_students'].fillna(Uni['international_students'].apply(fillstudents))

In [125]:
#visualizacon de los campos a utilizar
Uni.isna().sum()

research_output           0
international_students    0
type                      0
score                     0
dtype: int64

In [126]:
#comvercion del campo international_students  de string a int
Uni['international_students']=Uni['international_students'].astype(int)
Uni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6482 entries, 0 to 6481
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   research_output         6482 non-null   object
 1   international_students  6482 non-null   int64
 2   type                    6482 non-null   object
 3   score                   6482 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 202.7+ KB

# Tercera Parte: Normalizacion de Datos

In [186]:
trainDatax = Uni[['research_output','international_students','type']].copy()
trainDatay = Uni[['score']].copy()
print(trainDatay.head(),"\n", trainDatax.head())

   score
0  100.0
1   98.7
2   98.3
3   97.2
4   96.9
   research_output  international_students     type
0       very high                    3730  private
1       very high                    3879  private
2       very high                    5877  private
3       very high                    7925   public
4       very high                     692  private

In [187]:
trainDatax['type'], categoryType = trainDatax['type'].factorize(sort=True)
categoryType

Index(['private', 'public'], dtype='object')

In [188]:
trainDatax.type

0       0
1       0
2       0
3       1
4       0
       ..
6477    1
6478    1
6479    1
6480    1
6481    1
Name: type, Length: 6482, dtype: int64

In [189]:
trainDatax['research_output'], categoryReasearch = trainDatax['research_output'].factorize(sort = True)
categoryResearch

Index(['high', 'low', 'medium', 'very high'], dtype='object')

In [190]:
trainDatax.head()

   research_output  international_students  type
0                3                    3730     0
1                3                    3879     0
2                3                    5877     0
3                3                    7925     1
4                3                     692     0

In [191]:
# categorizando el campo score
pd.cut(trainDatay['score'],10,retbins = True)

(0       (92.35, 100.0]
 1       (92.35, 100.0]
 2       (92.35, 100.0]
 3       (92.35, 100.0]
 4       (92.35, 100.0]
              ...
 6477     (46.45, 54.1]
 6478     (46.45, 54.1]
 6479     (46.45, 54.1]
 6480     (46.45, 54.1]
 6481     (46.45, 54.1]
 Name: score, Length: 6482, dtype: category
 Categories (10, interval[float64, right]): [(23.424, 31.15] < (31.15, 38.8] < (38.8, 46.45] < (46.45, 54.1] ... (69.4, 77.05] < (77.05, 84.7] < (84.7, 92.35] < (92.35, 100.0]],
 array([ 23.4235,  31.15  ,  38.8   ,  46.45  ,  54.1   ,  61.75  ,
         69.4   ,  77.05  ,  84.7   ,  92.35  , 100.    ]))

In [192]:
trainDatay['score'] = pd.cut(trainDatay.score, [20,30,40,50,60,70,80,90,100])

In [193]:
trainDatay.iloc[0:100:15]

        score
0   (90, 100]
15  (90, 100]
30   (80, 90]
45   (70, 80]
60   (70, 80]
75   (60, 70]
90   (60, 70]

In [194]:
from sklearn.preprocessing import StandardScaler

In [195]:
scaler = StandardScaler()
scaler.fit(trainDatax)
print(scaler.mean_)

[2.26056773e+00 3.27118019e+03 8.15797593e-01]

In [196]:
trainDatax = scaler.fit_transform(trainDatax)
trainDatax

array([[ 0.59853711,  0.11573106, -2.10447398],
       [ 0.59853711,  0.15331428, -2.10447398],
       [ 0.59853711,  0.65728261, -2.10447398],
       ...,
       [-0.21091783, -0.11229065,  0.47517813],
       [-1.82982772, -0.22125678,  0.47517813],
       [-1.82982772, -0.244967  ,  0.47517813]])

In [197]:
from sklearn.decomposition import PCA
pca = PCA(n_components=3)
pca.fit(trainDatax)
print(pca.explained_variance_ratio_)

[0.41835861 0.29753802 0.28410338]

In [198]:
print(trainDatax, trainDatay)

[[ 0.59853711  0.11573106 -2.10447398]
 [ 0.59853711  0.15331428 -2.10447398]
 [ 0.59853711  0.65728261 -2.10447398]
 ...
 [-0.21091783 -0.11229065  0.47517813]
 [-1.82982772 -0.22125678  0.47517813]
 [-1.82982772 -0.244967    0.47517813]]           score
0     (90, 100]
1     (90, 100]
2     (90, 100]
3     (90, 100]
4     (90, 100]
...         ...
6477   (40, 50]
6478   (40, 50]
6479   (40, 50]
6480   (40, 50]
6481   (40, 50]

[6482 rows x 1 columns]